[
{
    "JourneyCategory": "Long-term Rotational Internship @<a href=\"https://www.cambridgesciencepark.co.uk/\">Industry Research center, Cambridge Science Park</a>, UK | ",
    "LegacyJourneyCategory":"<img width=\"34\" height=\"20\" src=\"./asset/photo/Logo/Hisilicon.png\" alt=\"Hisilicon\"/>  <a href=\"https://www.hisilicon.com/en/products/Kirin\">HiSilicon Kirin Chipsets Dept.</a>, <img width=\"20\" height=\"20\" src=\"./asset/photo/Logo/Huawei.png\" alt=\"Huawei\"/>   <a href=\"https://www.cambridgesciencepark.co.uk/company-directory/hauwei-uk-rd-centre/\">Huawei Research center, Cambridge Science Park</a>, UK.<br />",
    "Title": "Dec 2022 - Jan 2024",  
    "Journey": "We explore various architectural and algorithmic innovations towards the next-generation mobile or cloud based processors (CPU, GPU, NPU). During these period of time, I am also exposed to other research summits or events hosted, including talks and connections with other academic professors and industry experts. The topics discussed range from the above to more, such as simulation, LLM, compiler and federated learning, which I enjoy the most.<br /><br />   In particular, I focus on Ray Tracing acceleration via classical graphics and machine learning techniques, under supervision of senior engineers and Mathematics graduates. During which, I maintain and develop a open-source research <a href=\"https://github.com/knightcrawler25/GLSL-PathTracer\">GLSL path renderer</a> in C and GLSL. With the renderer setup, I redesign the underlying BVH algorithms, keeping balance between preprocessing time and real-time intersection complexity. One of our proposed methods are deployed in the product and thus received research-center-wise award.  Besides, we also explore various possibilities of combining AI / machine learning with graphics task, including Ambient Occlusion or Global illumination, which I help integrate the renderer and Pytorch training pipeline, as part of the research explorations.<br /><br />  Aside from that, I also join the CPU team on heterogeneous scheduling, DVFS and dynamic resource management, supervised by PhD graduate in Electrical Engineering and other engineers. I initialize the codebase for the scheduler simulator in Python, from which the team develop the prototype for the next-gen scheduling policies based on the literature review I collected. In general, the difficulty lies in the multi-objective optimization and tradeoff between performance, power consumption, thermal conditions, priorities, fairness and other factors."
}
]