[
{
    "JourneyCategory": "Research Engineer Intern (<b>Graphics Algorithms / GPU Architecture</b>): <a href=\"asset/photo/Profile/GPU2.png\">more</a><br/>",
    "Title": "<a href=\"./asset/doc/StarofCambridge.png\">Award for new prediction algorithm</a> - May 2023 - Jan 2024",  
    "Journey": "Supervised by senior AI reseacher, and senior GPU Architects, I optimize real-time accelerated Algorithms under GPU hardware architecture, with one solution having Research Center Award and Outstanding Individual Prize (only 3 / yr) and under global patent application. <br /> (1) Experiment existing and brand-new **research ideas** (more than 5 different directions) in 3D Graphic render and image processing under real-world scenario.<br /> - Graphics: Linear Algebra, Convolution (Bilateral Filter Kernel on Monte Carlo Samples using GBuffer), spatial-temporal locality.<br /> - Neural Network: Train (lr decay, shuffle data 5GB+, dropout) and Infer (conservative loss), Positional Encoding, etc. [jointly with AI team] <br /> - Performance Engineer / Data structure design, targeting micro-benchmarks (performance counters, cache hit rate, etc.)<br /><br /> (2) As the key developer for simulation framework, gain hands-on experience on **modelling and simulation**. <br /> - Real-time millions of triangles renderer (OpenGL, GLSL, ImGui, etc). <br /> - Debug skills, CPU multithreading (OpenMP), Memory Models (texture, UBO, SSBO), Performance Measurement (RenderDoc), Unit Tests (Google Test framework), etc. <br /> - Follow open-source library and industry standards. Platform-neutral dual implementation (conditional compilation/macro), UML class (Doxygen), CMake. <br /><br /> (3) Meanwhile, host series knowledge **sharing sessions** about my research topic. <br />  Prepare detailed and self-contained material (120+ slides). Sharing sessions last around 3 hours in total. Also gain insight from the feedback of participants. <br /><br /> Attend Thames Summit & European Innovation Star Workshop 2023, ranging from AI, Arch and Graphics. <br /> (Unpaid research during term time, explicitly requested from me.) <br /><br /> **Skills**: PyTorch · Neural Networks · System on a Chip (SoC) · OpenGL Shading Language (GLSL) · OpenGL · C++ · Computer Graphics <br />"
},
{
    "JourneyCategory": "Research Intern (<b>CPU Architect</b>): <a href=\"asset/photo/Profile/CPU.png\">more</a> | ",
    "Title": "Jun 2023 - Oct 2024. <br /><a href=\"https://peterhuistyping.github.io/CPU_Scheduling_Review/\">Literature Review: Scheduling, DVFS, Dynamic Resource Management</a>",  
    "Journey": "CPU, OS and Architecture research based on Linux existing implementation. Provide solutions to compute/memory bottlenecks. Explore the \"Secret Sauce\", which is really exciting!<br />  (1) Research into CPU Scheduling, DVFS policy, Dynamic Resource Sleep (Idle Management) and related topics in different architectures.<br /> Explore and gain knowledge to various papers, dating from 1995. Bring new ideas on Algorithm and Architecture design to next - generation development.<br /> Focus on general Energy, Task Models and Algorithms with solid Mathematical Proofs with Definitions, Lemma and Theorems. Use of Optimisation (Duality, Convex, LP, Pareto Optimality from Stanford CVX101), Online Algorithms (with Competitive Analysis), Disjoint Set Union - find, etc.<br /><br /> (2) Assist building the task model and estimating power model based on CMOS design. Set up Simulation platform (Event - Driven architecture with State Machine).<br /> Python programming (Numpy, Matplotlib, Networkx, Pandas, DAG, TopologicalSorter, etc). <br /> Compare and contrast different algorithms motivations and performance advantages and issues. Consider Performance (QoS like Fairness), Energy (Temperature and thermal power), Memory Contention, floor - plan of the chip, applications features and Complexity of the Algorithms. <br /><br /> (3) Apply Systematic Literature Review (Webster&Watson, 2002).<br /> Involve taxonomy (on paper's year, topic, institution) and interdisciplinary solutions covering Mathematical Model, Algorithm and Computer Architecture.<br /> Learn related methods including Control Theory (PID), Machine Learning, etc.<br /><br /> (4) Deliver review and design ideas sharing sessions within the internal team. Discuss with colleagues on existing and potential design. Attend NANDA 2023 at Imperial.<br />(Mixed GPU and CPU research projects, out of interest. During term time, I explicitly apply for unpaid experience but still contribute to the project.)<br /><br /> **Skills**: Optimization · DVFS · Computer Architecture · Scheduling · CPU design · Operating Systems · Machine Learning · Python (Programming Language)"
},
{
    "JourneyCategory": "Software Engineer Intern (<b>GPU</b>): <a href=\"asset/photo/Profile/GPU1.png\">more</a> | ",
    "Title": "Dec 2022 - May 2023",  
    "Journey": "Projects on GPU driver and verification, Game Engines (UE4). Workflow of GPU industry, Vulkan graphics API. <br /> <br /> Introducing independent full automation tools in the project, reducing error rate to nearly 0%. (See link attached) <br /> <br /> C++, CMake, Gdb, Git version control, CI/CD pipeline, CMake, hands-on experience on Linux server, etc. Working and collaborating with colleagues, fixing C++ build or link errors. <br /> <br /> **Skills**: Docker · Continuous Integration and Continuous Delivery (CI/CD) · Gdb · Vulkan · C++ · CMake · Game Engines · GPU 3D Pipeline · GPU driver · UE4 (rendering)"
}
]